app/controllers/main_controller.rb

  def index
    @user_list = User.all.map { |u| ["#{u.first_name} #{u.last_name}",u.id] }
---
SELECT * FROM `users`

  def get_vacation_days
    user = User.find(params['user_id'])
    uv = UserVacation.find(:all, :conditions => ['user_id = ? and year(vacation_start) = ?',params['user_id'], params['year']])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `user_vacations` WHERE (user_id = '' and year(vacation_start) = '2012')

  def add_vacation_days
    uv = UserVacation.new

    uv.vacation_end = params["vend"]
    uv.vacation_start = params["vstart"]
    uv.user_id = params['user_id']

    ret_val = "SUCCESS"
    ret_val = "ERROR: Vacation start date cannot be null" if uv.vacation_start.blank?
    ret_val = "ERROR: Vacation end date cannot be null" if uv.vacation_end.blank?
    ret_val = "ERROR: Vacation start is later than vacation end date." if !uv.vacation_start.blank? && !uv.vacation_end.blank? && uv.vacation_start > uv.vacation_end
    uv.save! if ret_val == 'SUCCESS'
---
INSERT INTO `user_vacations` (`user_id`, `vacation_start`, `vacation_end`, `is_half_day`, `created_at`, `updated_at`) VALUES(1, '2012-02-02', '2012-02-02', 1, '2012-02-27 07:54:01', '2012-02-27 07:54:01')

  def add_user
    user = User.new
    user.last_name = params['last_name']
    user.first_name = params['first_name']
    user.start_date = params['start_date']
    ret_val = 'SUCCESS'
    ret_val = 'ERROR: First and Last name must not be blank' if user.last_name.blank? || user.first_name.blank?
    user.save! if ret_val == 'SUCCESS'
---
INSERT INTO `users` (`first_name`, `last_name`, `start_date`, `created_at`, `updated_at`) VALUES('Elton', 'Chung', '2005-01-01', '2012-02-13 03:37:04', '2012-02-13 03:37:04')

  def remove_user
    user = User.find(params['user_id'])
    user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
DELETE FROM `users` WHERE `id` = 2

  def remove_vacation_day
    id = params['id']
    UserVacation.find(id).delete
---
DELETE FROM `user_vacations` WHERE (`id` IN (1))
SELECT * FROM `user_vacations` WHERE (`user_vacations`.`id` = 1)