app/controllers/user_controller.rb

SELECT * FROM `users`
---
  def index
    @user_list = User.all.map {|u| ["#{u.first_name} #{u.last_name}", u.id] }

SELECT * FROM `users` WHERE (id = '2') LIMIT 1
---
  def find_user
    user = User.find(:first, :conditions => ['id = ?', params['user_id']])