app/controllers/vacation_tracker_controller.rb

  def index
    @user_list = User.all.map { |u| ["#{u.first_name} #{u.last_name}",u.id] }
---
SELECT * FROM `users`

  def get_vacation_days
    user = User.find(params['user_id'])
    user_vacations = UserVacation.find(:all, :conditions => ['user_id = ? and year(vacation_start) = ?',params['user_id'], params['year']])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `user_vacations` WHERE (user_id = '1' and year(vacation_start) = '2012')

  def add_vacation_days
    uv = UserVacation.new

    uv.vacation_end = params["vend"]
    uv.vacation_start = params["vstart"]
    uv.user_id = params['user_id']
    uv.is_half_day = params['half_day']

    ret_val = "SUCCESS"
    ret_val = "ERROR: Please select a user" if uv.user_id.blank?
    ret_val = "ERROR: Vacation start date cannot be null" if uv.vacation_start.blank?
    ret_val = "ERROR: Vacation end date cannot be null" if uv.vacation_end.blank?
    ret_val = "ERROR: Vacation start is later than vacation end date." if !uv.vacation_start.blank? && !uv.vacation_end.blank? && uv.vacation_start > uv.vacation_end
    ret_val = "ERROR: Half day can only be used with same start and end days" if uv.is_half_day && uv.vacation_end != uv.vacation_start
    uv.save! if ret_val == 'SUCCESS'
---
INSERT INTO `user_vacations` (`user_id`, `vacation_start`, `vacation_end`, `is_half_day`, `created_at`, `updated_at`) VALUES(1, '2012-02-01', '2012-02-04', 0, '2012-03-02 01:39:16', '2012-03-02 01:39:16')